app/controllers/api/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 3]]
---
      def load_movie
        @movie = Movie.find(params[:movie_id])