app/controllers/api/users_controller.rb

SELECT  1 AS one FROM "movies" INNER JOIN "movies_users" ON "movies"."id" = "movies_users"."movie_id" WHERE "movies_users"."user_id" = ? AND "movies"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
---
    def remove_movie
      if @user.movies.include?(@movie)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]
---
      def load_user
        @user = User.find(params[:user_id])

SELECT "user_movies".* FROM "user_movies" WHERE (user_id IN (1) AND movie_id NOT IN (1))
---
      def load_movie
        @movie = Movie.find(params[:movie_id])