app/views/api/movies/users.json.jbuilder

SELECT "users".* FROM "users" INNER JOIN "movies_users" ON "users"."id" = "movies_users"."user_id" WHERE "movies_users"."movie_id" = ?  [["movie_id", 3]]
---
  json.email       user_movie.user.email
  json.first_name  user_movie.user.first_name